[Killed] Throw_
Homepage/Business/HomepageBusinessFacade.php:18:13
         try {
             return $this->itemsTransferService->itemTransfer($slug);
         } catch (\Exception $e) {
-            throw $e; // You can handle exceptions here if needed
+            $e;
         }
     }
killedBy: App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
statusReason: 1) App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [1049] Unknown database 'BuyMyTrikots-Symfony_test1'

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/nicogruenewald/Documents/BuyMyT
