[Killed] PublicVisibility
Authentication/Business/UserLoginValidation.php:16:5
     )
     {
     }
-    public function authenticate(array $formData, SessionInterface $session): ResponseDTO
+    protected function authenticate(array $formData, SessionInterface $session) : ResponseDTO
     {
         $email = $formData['email'];
killedBy: App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithEmptyEmailAndPassword
statusReason: 1) App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithEmptyEmailAndPassword
Error: Call to protected method App\Components\Authentication\Business\UserLoginValidation::authenticate() from scope App\Tests\Components\Authentication\Business\UserLoginValidationTest

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Authentication/Business/User

[Killed] LogicalOrNegation
Authentication/Business/UserLoginValidation.php:21:9
         $email = $formData['email'];
         $plainPassword = $formData['password'];
 
-        if (empty($email) || empty($plainPassword)) {
+        if (!(empty($email) || empty($plainPassword))) {
             return new ResponseDTO('Email or password cannot be empty', 'Error');
         }
killedBy: App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithEmptyEmailAndPassword
statusReason: 1) App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithEmptyEmailAndPassword
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Email or password cannot be empty'
+'User not found'

[Killed] LogicalOrAllSubExprNegation
Authentication/Business/UserLoginValidation.php:21:9
         $email = $formData['email'];
         $plainPassword = $formData['password'];
 
-        if (empty($email) || empty($plainPassword)) {
+        if (!empty($email) || !empty($plainPassword)) {
             return new ResponseDTO('Email or password cannot be empty', 'Error');
         }
killedBy: App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithEmptyEmailAndPassword
statusReason: 1) App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithEmptyEmailAndPassword
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Email or password cannot be empty'
+'User not found'

[Killed] LogicalNot
Authentication/Business/UserLoginValidation.php:31:9
             return new ResponseDTO('User not found', 'Error');
         }
 
-        if (!password_verify($plainPassword, $user->getPassword())) {
+        if (password_verify($plainPassword, $user->getPassword())) {
             return new ResponseDTO('Invalid credentials', 'Error');
         }
killedBy: App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithInvalidCredentials
statusReason: 1) App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithInvalidCredentials
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Invalid credentials'
+'Login successful!'

[Killed] MethodCallRemoval
Authentication/Business/UserLoginValidation.php:35:9
             return new ResponseDTO('Invalid credentials', 'Error');
         }
 
-        $session->set('user', $email);
+        
         return new ResponseDTO('Login successful!', 'OK');
     }
killedBy: App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithValidCredentials
statusReason: 1) App\Tests\Components\Authentication\Business\UserLoginValidationTest::testAuthenticateWithValidCredentials
Expectation failed for method name is "set" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
