[Survived] PublicVisibility
Authentication/Communication/AuthenticationController.php:12:5
 
 class AuthenticationController extends AbstractController
 {
-    #[Route('/login', name: 'app_login')]
+    protected function login(AuthenticationUtils $authenticationUtils) : Response
     public function login(AuthenticationUtils $authenticationUtils): Response
     {

[Survived] ArrayItemRemoval
Authentication/Communication/AuthenticationController.php:18:9
         $error = $authenticationUtils->getLastAuthenticationError();
         $lastUsername = $authenticationUtils->getLastUsername();
 
-        return $this->render('security/login.html.twig', [
-            'last_username' => $lastUsername,
-            'error' => $error,
-        ]);
+        return $this->render('security/login.html.twig', ['error' => $error]);
     }
 }
