[Killed] PublicVisibility
Homepage/Communication/HomepageController.php:20:5
     {
     }
 
-    #[Route('/home/', name: 'app_homepage')]
+    protected function index() : Response
     public function index(): Response
     {
killedBy: App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
statusReason: 1) App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [1049] Unknown database 'BuyMyTrikots-Symfony_test1'

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/nicogruenewald/Documents/BuyMyT

[Killed] PublicVisibility
Homepage/Communication/HomepageController.php:28:5
         ]);
     }
 
-    #[Route('/home/browse/{slug}', name: 'app_browse')]
+    protected function browse(string $slug) : Response
     public function browse(string $slug): Response
     {
killedBy: App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
statusReason: 1) App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [1049] Unknown database 'BuyMyTrikots-Symfony_test1'

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/nicogruenewald/Documents/BuyMyT

[Killed] PublicVisibility
Homepage/Communication/HomepageController.php:43:5
         ]);
     }
 
-    #[Route('/home/search', name: 'search_redirect')]
+    protected function searchRedirect(Request $request) : Response
     public function searchRedirect(Request $request): Response
     {
killedBy: App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
statusReason: 1) App\Tests\Components\Homepage\Communication\HomepageControllerTest::testHomepageNoUser
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [1049] Unknown database 'BuyMyTrikots-Symfony_test1'

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/nicogruenewald/Documents/BuyMyT
