[Killed] NullSafeMethodCall
Orderflow/Business/OrderFlowBusinessFacade.php:38:9
 
     public function getUserIdentifier(Security $security): string
     {
-        return $security->getUser()?->getUserIdentifier();
+        return $security->getUser()->getUserIdentifier();
     }
 
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowBusinessFacadeTest::testValidateValidOrder
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [1049] Unknown database 'BuyMyTrikots-Symfony_test1'

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/nicogruenewald/Documents/B

[Killed] NullSafeMethodCall
Orderflow/Business/OrderFlowBusinessFacade.php:48:9
 
     public function getUserID(Security $security) : int
     {
-        return $security->getUser()?->getId();
+        return $security->getUser()->getId();
     }
 
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowBusinessFacadeTest::testValidateValidOrder
Doctrine\DBAL\Exception\ConnectionException: An exception occurred in the driver: SQLSTATE[HY000] [1049] Unknown database 'BuyMyTrikots-Symfony_test1'

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/vendor/doctrine/dbal/src/Driver/API/MySQL/ExceptionConverter.php:101
/home/nicogruenewald/Documents/B
