[Killed] MethodCallRemoval
Authentication/Presentation/LoginFormType.php:17:9
 {
     public function buildForm(FormBuilderInterface $builder, array $options) : void
     {
-        $builder
-            ->add('email', EmailType::class)
-            ->add('password', PasswordType::class)
-            ->add('submit', SubmitType::class, ['label' => 'Login']);
+        
     }
 }
killedBy: App\Tests\Components\Authentication\Presentation\LoginFormTypeTest::testSubmitValidData
statusReason: 1) App\Tests\Components\Authentication\Presentation\LoginFormTypeTest::testSubmitValidData
Symfony\Component\Form\Exception\OutOfBoundsException: Child "email" does not exist.

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/vendor/symfony/form/Form.php:815
/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Authentication/Presentation/LoginFormTypeTest.php:21

ERRORS!
Tests:

[Survived] ArrayItemRemoval
Authentication/Presentation/LoginFormType.php:20:13
         $builder
             ->add('email', EmailType::class)
             ->add('password', PasswordType::class)
-            ->add('submit', SubmitType::class, ['label' => 'Login']);
+            $builder->add('email', EmailType::class)->add('password', PasswordType::class)->add('submit', SubmitType::class, []);
     }
 }
