[Killed] PublicVisibility
Orderflow/Business/OrderFlowValidation.php:10:5
 
 class OrderFlowValidation
 {
-    public function validate(Orders $order): ?array
+    protected function validate(Orders $order) : ?array
     {
         return [
killedBy: App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
Error: Call to protected method App\Components\Orderflow\Business\OrderFlowValidation::validate() from scope App\Tests\Components\Orderflow\Business\OrderFlowValidationTest

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Orderflow/Business/OrderFlowValidationTest.php:32

ERRORS!
Tests: 1, Asserti

[Killed] LogicalOrNegation
Orderflow/Business/OrderFlowValidation.php:25:9
 
     private function validateFirstName($firstName): ?ResponseDTO
     {
-        if (empty($firstName) || !is_string($firstName)) {
+        if (!(empty($firstName) || !is_string($firstName))) {
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
killedBy: App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
Failed asserting that App\Global\Persistence\DTO\ResponseDTO Object &000000000000016d0000000000000000 (
    'message' => 'First name cannot be empty and must be a string.'
    'type' => 'Error'
) is null.

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Orderflow/Business/OrderFlowValidationTest.p

[Killed] LogicalOrAllSubExprNegation
Orderflow/Business/OrderFlowValidation.php:25:9
 
     private function validateFirstName($firstName): ?ResponseDTO
     {
-        if (empty($firstName) || !is_string($firstName)) {
+        if (!empty($firstName) || is_string($firstName)) {
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
killedBy: App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
Failed asserting that App\Global\Persistence\DTO\ResponseDTO Object &000000000000016d0000000000000000 (
    'message' => 'First name cannot be empty and must be a string.'
    'type' => 'Error'
) is null.

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Orderflow/Business/OrderFlowValidationTest.p

[Killed] NewObject
Orderflow/Business/OrderFlowValidation.php:26:13
     private function validateFirstName($firstName): ?ResponseDTO
     {
         if (empty($firstName) || !is_string($firstName)) {
-            return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
+            new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
+            return null;
         }
 
killedBy: App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidateEdgeCases
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidateEdgeCases
Failed asserting that null is an instance of class "App\Global\Persistence\DTO\ResponseDTO".

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Orderflow/Business/OrderFlowValidationTest.php:62

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] LogicalOr
Orderflow/Business/OrderFlowValidation.php:30:9
         }
 
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
+        if (strlen($firstName) >= 30 && strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
             !preg_match('/^[\p{L}\s-]+$/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
killedBy: App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
Failed asserting that null is an instance of class "App\Global\Persistence\DTO\ResponseDTO".

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Orderflow/Business/OrderFlowValidationTest.php:50

FAILURES!
Tests: 1, Assertions: 10, Failures: 1.

[Killed] LessThanOrEqualToNegotiation
Orderflow/Business/OrderFlowValidation.php:30:9
         }
 
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
+        if (strlen($firstName) >= 30 || strlen($firstName) > 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
             !preg_match('/^[\p{L}\s-]+$/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
killedBy: App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
Failed asserting that App\Global\Persistence\DTO\ResponseDTO Object &000000000000016d0000000000000000 (
    'message' => 'Oops, your first name doesn't look right!'
    'type' => 'Error'
) is null.

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Orderflow/Business/OrderFlowValidationTest.php:35

[Killed] LogicalNot
Orderflow/Business/OrderFlowValidation.php:31:13
 
         $firstName = $this->trim($firstName);
         if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
-            !preg_match('/^[\p{L}\s-]+$/u', $firstName)) {
+            if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
killedBy: App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
statusReason: 1) App\Tests\Components\Orderflow\Business\OrderFlowValidationTest::testValidate
Failed asserting that App\Global\Persistence\DTO\ResponseDTO Object &000000000000016d0000000000000000 (
    'message' => 'Oops, your first name doesn't look right!'
    'type' => 'Error'
) is null.

/home/nicogruenewald/Documents/BuyMyTrikots-Symfony/tests/Components/Orderflow/Business/OrderFlowValidationTest.php:35

[Survived] PregMatchRemoveDollar
Orderflow/Business/OrderFlowValidation.php:31:13
 
         $firstName = $this->trim($firstName);
         if (strlen($firstName) >= 30 || strlen($firstName) <= 2 ||
-            !preg_match('/^[\p{L}\s-]+$/u', $firstName)) {
+            if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
