1) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Authentication/Business/Model/UserLoginValidation.php:21    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         $email = $formData['email'];
         $plainPassword = $formData['password'];
-        if (empty($email) || empty($plainPassword)) {
+        if (empty($email) && empty($plainPassword)) {
             return new ResponseDTO('Email or password cannot be empty', 'Error');
         }
         $user = $this->repository->findOneByEmail($email);
