2) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Authentication/Communication/AuthenticationController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class AuthenticationController extends AbstractController
 {
     #[Route('/login', name: 'app_login')]
-    public function login(AuthenticationUtils $authenticationUtils) : Response
+    protected function login(AuthenticationUtils $authenticationUtils) : Response
     {
         $error = $authenticationUtils->getLastAuthenticationError();
         $lastUsername = $authenticationUtils->getLastUsername();

3) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Authentication/Communication/AuthenticationController.php:18    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $error = $authenticationUtils->getLastAuthenticationError();
         $lastUsername = $authenticationUtils->getLastUsername();
-        return $this->render('security/login.html.twig', ['last_username' => $lastUsername, 'error' => $error]);
+        return $this->render('security/login.html.twig', ['error' => $error]);
     }
 }

4) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Authentication/Presentation/LoginFormType.php:20    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function buildForm(FormBuilderInterface $builder, array $options) : void
     {
-        $builder->add('email', EmailType::class)->add('password', PasswordType::class)->add('submit', SubmitType::class, ['label' => 'Login']);
+        $builder->add('email', EmailType::class)->add('password', PasswordType::class)->add('submit', SubmitType::class, []);
     }
 }
