2) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Business/Model/OrderLogicHandling.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $errors = $this->validate($orderDTO);
         if (empty($errors)) {
             $orderDTO->email = $userDTO->email;
-            $this->orderFlowEntityManager->create($orderDTO, $userDTO);
+            
         }
         return $errors;
     }

3) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Business/Model/OrderLogicHandling.php:30    [M] ArrayOneItem

--- Original
+++ New
@@ @@
             $orderDTO->email = $userDTO->email;
             $this->orderFlowEntityManager->create($orderDTO, $userDTO);
         }
-        return $errors;
+        return count($errors) > 1 ? array_slice($errors, 0, 1, true) : $errors;
     }
     private function validate(OrderDTO $orderDTO) : array
     {

4) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:32    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
+        if (strlen($firstName) > 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
         return null;

5) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:32    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
+        if (strlen($firstName) >= 30 || strlen($firstName) < 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
         return null;

6) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:32    [M] LogicalOr

--- Original
+++ New
@@ @@
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
+        if (strlen($firstName) >= 30 && strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
         return null;

7) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:33    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
+        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
         return null;

8) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:33    [M] PregMatchRemoveFlags

--- Original
+++ New
@@ @@
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
+        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
         return null;

9) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:46    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('Last name cannot be empty and must be a string.', 'Error');
         }
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
+        if (strlen($lastName) > 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
             return new ResponseDTO('Oops, your last name doesn\'t look right!', 'Error');
         }
         return null;

10) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:46    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('Last name cannot be empty and must be a string.', 'Error');
         }
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
+        if (strlen($lastName) >= 30 || strlen($lastName) < 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
             return new ResponseDTO('Oops, your last name doesn\'t look right!', 'Error');
         }
         return null;

11) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:46    [M] LogicalOr

--- Original
+++ New
@@ @@
             return new ResponseDTO('Last name cannot be empty and must be a string.', 'Error');
         }
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
+        if (strlen($lastName) >= 30 && strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
             return new ResponseDTO('Oops, your last name doesn\'t look right!', 'Error');
         }
         return null;

12) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:47    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
             return new ResponseDTO('Last name cannot be empty and must be a string.', 'Error');
         }
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
+        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/[\\p{L}\\s-]+$/u', $lastName)) {
             return new ResponseDTO('Oops, your last name doesn\'t look right!', 'Error');
         }
         return null;

13) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:47    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
             return new ResponseDTO('Last name cannot be empty and must be a string.', 'Error');
         }
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
+        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+/u', $lastName)) {
             return new ResponseDTO('Oops, your last name doesn\'t look right!', 'Error');
         }
         return null;

14) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:47    [M] PregMatchRemoveFlags

--- Original
+++ New
@@ @@
             return new ResponseDTO('Last name cannot be empty and must be a string.', 'Error');
         }
         $lastName = $this->trim($lastName);
-        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $lastName)) {
+        if (strlen($lastName) >= 30 || strlen($lastName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/', $lastName)) {
             return new ResponseDTO('Oops, your last name doesn\'t look right!', 'Error');
         }
         return null;

15) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:60    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('City cannot be empty and must be a string.', 'Error');
         }
         $city = $this->trim($city);
-        if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
+        if (strlen($city) > 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
             return new ResponseDTO('Oops, your City doesn\'t look right!', 'Error');
         }
         return null;

16) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:60    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('City cannot be empty and must be a string.', 'Error');
         }
         $city = $this->trim($city);
-        if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
+        if (strlen($city) >= 20 || strlen($city) < 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
             return new ResponseDTO('Oops, your City doesn\'t look right!', 'Error');
         }
         return null;

17) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:60    [M] LogicalOr

--- Original
+++ New
@@ @@
             return new ResponseDTO('City cannot be empty and must be a string.', 'Error');
         }
         $city = $this->trim($city);
-        if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
+        if (strlen($city) >= 20 && strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
             return new ResponseDTO('Oops, your City doesn\'t look right!', 'Error');
         }
         return null;

18) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:61    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
             return new ResponseDTO('City cannot be empty and must be a string.', 'Error');
         }
         $city = $this->trim($city);
-        if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
+        if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/[a-zA-Z\\s-]+$/', $city)) {
             return new ResponseDTO('Oops, your City doesn\'t look right!', 'Error');
         }
         return null;

19) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:61    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
             return new ResponseDTO('City cannot be empty and must be a string.', 'Error');
         }
         $city = $this->trim($city);
-        if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $city)) {
+        if (strlen($city) >= 20 || strlen($city) <= 2 || !preg_match('/^[a-zA-Z\\s-]+/', $city)) {
             return new ResponseDTO('Oops, your City doesn\'t look right!', 'Error');
         }
         return null;

20) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:74    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('State cannot be empty and must be a string.', 'Error');
         }
         $state = $this->trim($state);
-        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
+        if (strlen($state) > 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
             return new ResponseDTO('Oops, your State doesn\'t look right!', 'Error');
         }
         return null;

21) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:74    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('State cannot be empty and must be a string.', 'Error');
         }
         $state = $this->trim($state);
-        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
+        if (strlen($state) >= 20 || strlen($state) < 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
             return new ResponseDTO('Oops, your State doesn\'t look right!', 'Error');
         }
         return null;

22) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:74    [M] LogicalOr

--- Original
+++ New
@@ @@
             return new ResponseDTO('State cannot be empty and must be a string.', 'Error');
         }
         $state = $this->trim($state);
-        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
+        if (strlen($state) >= 20 && strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
             return new ResponseDTO('Oops, your State doesn\'t look right!', 'Error');
         }
         return null;

23) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:74    [M] LogicalOr

--- Original
+++ New
@@ @@
             return new ResponseDTO('State cannot be empty and must be a string.', 'Error');
         }
         $state = $this->trim($state);
-        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
+        if ((strlen($state) >= 20 || strlen($state) <= 2) && !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
             return new ResponseDTO('Oops, your State doesn\'t look right!', 'Error');
         }
         return null;

24) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:75    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
             return new ResponseDTO('State cannot be empty and must be a string.', 'Error');
         }
         $state = $this->trim($state);
-        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
+        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/[a-zA-Z\\s-]+$/', $state)) {
             return new ResponseDTO('Oops, your State doesn\'t look right!', 'Error');
         }
         return null;

25) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:75    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
             return new ResponseDTO('State cannot be empty and must be a string.', 'Error');
         }
         $state = $this->trim($state);
-        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+$/', $state)) {
+        if (strlen($state) >= 20 || strlen($state) <= 2 || !preg_match('/^[a-zA-Z\\s-]+/', $state)) {
             return new ResponseDTO('Oops, your State doesn\'t look right!', 'Error');
         }
         return null;

26) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:105    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
             return new ResponseDTO('Zip code cannot be empty and must be a string.', 'Error');
         }
         $zip = $this->trim($zip);
-        if (!preg_match('/^\\d{4,6}$/', $zip)) {
+        if (!preg_match('/\\d{4,6}$/', $zip)) {
             return new ResponseDTO('Oops, your Postcode doesn\'t look right!', 'Error');
         }
         return null;

27) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:105    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
             return new ResponseDTO('Zip code cannot be empty and must be a string.', 'Error');
         }
         $zip = $this->trim($zip);
-        if (!preg_match('/^\\d{4,6}$/', $zip)) {
+        if (!preg_match('/^\\d{4,6}/', $zip)) {
             return new ResponseDTO('Oops, your Postcode doesn\'t look right!', 'Error');
         }
         return null;

28) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:118    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('Address cannot be empty and must be a string.', 'Error');
         }
         $address = $this->trim($address);
-        if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
+        if (strlen($address) > 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
             return new ResponseDTO('Oops, your Address doesn\'t look right!', 'Error');
         }
         return null;

29) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:118    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
             return new ResponseDTO('Address cannot be empty and must be a string.', 'Error');
         }
         $address = $this->trim($address);
-        if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
+        if (strlen($address) >= 20 || strlen($address) < 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
             return new ResponseDTO('Oops, your Address doesn\'t look right!', 'Error');
         }
         return null;

30) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:118    [M] LogicalOr

--- Original
+++ New
@@ @@
             return new ResponseDTO('Address cannot be empty and must be a string.', 'Error');
         }
         $address = $this->trim($address);
-        if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
+        if (strlen($address) >= 20 && strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
             return new ResponseDTO('Oops, your Address doesn\'t look right!', 'Error');
         }
         return null;

31) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:119    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
             return new ResponseDTO('Address cannot be empty and must be a string.', 'Error');
         }
         $address = $this->trim($address);
-        if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
+        if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/[a-zA-Z0-9\\s.-]+$/', $address)) {
             return new ResponseDTO('Oops, your Address doesn\'t look right!', 'Error');
         }
         return null;

32) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:119    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
             return new ResponseDTO('Address cannot be empty and must be a string.', 'Error');
         }
         $address = $this->trim($address);
-        if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+$/', $address)) {
+        if (strlen($address) >= 20 || strlen($address) <= 2 || !preg_match('/^[a-zA-Z0-9\\s.-]+/', $address)) {
             return new ResponseDTO('Oops, your Address doesn\'t look right!', 'Error');
         }
         return null;

33) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/Form/OrderFlowValidation.php:125    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return null;
     }
-    public function trim(string $value) : string
+    protected function trim(string $value) : string
     {
         return trim($value);
     }
 }

35) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Communication/OrderFlowController.php:60    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             throw $this->createNotFoundException('Order not found.');
         }
         $items = $this->orderFlowBusinessFacade->findItemsByArrayOfIds($mostRecentOrder->getItems());
-        return $this->render('thank_you/index.html.twig', ['items' => $items, 'order' => $mostRecentOrder]);
+        return $this->render('thank_you/index.html.twig', ['order' => $mostRecentOrder]);
     }
 }

36) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Persistence/OrderFlowEntityManager.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $order = $this->orderMapper->map($orderDto);
         $items = $this->shoppingCartRepository->findCartItemsByUserId($userDto->id);
-        $order->setItems($items);
+        
         $this->entityManager->persist($order);
         $this->entityManager->flush();
         $this->shoppingCartEntityManager->removeAllAfterSuccessfulOrder($userDto->id);
     }
 }

37) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Persistence/OrderFlowEntityManager.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $items = $this->shoppingCartRepository->findCartItemsByUserId($userDto->id);
         $order->setItems($items);
         $this->entityManager->persist($order);
-        $this->entityManager->flush();
+        
         $this->shoppingCartEntityManager->removeAllAfterSuccessfulOrder($userDto->id);
     }
 }

38) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Persistence/OrderFlowEntityManager.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $order->setItems($items);
         $this->entityManager->persist($order);
         $this->entityManager->flush();
-        $this->shoppingCartEntityManager->removeAllAfterSuccessfulOrder($userDto->id);
+        
     }
 }

39) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Persistence/OrdersRepository.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function findMostRecentOrderByEmail(string $email) : ?Orders
     {
-        return $this->findOneBy(['email' => $email], ['id' => 'DESC']);
+        return $this->findOneBy(['email' => $email], []);
     }
 }

41) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Business/Model/UserRegistrationValidation.php:17    [M] ArrayOneItem

--- Original
+++ New
@@ @@
         $this->validateName($userDTO, $errorDTOList);
         $this->validateEmail($userDTO, $errorDTOList);
         $this->validatePassword($userDTO, $errorDTOList);
-        return $errorDTOList;
+        return count($errorDTOList) > 1 ? array_slice($errorDTOList, 0, 1, true) : $errorDTOList;
     }
     private function validateName($clientDTO, &$errorDTOList) : void
     {

42) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Business/Model/UserRegistrationValidation.php:37    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     private function validatePassword($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
+        if (empty($clientDTO->password) && !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
             $errorDTOList[] = new ResponseDTO('Oops, your password doesn\'t look right!', 'Exception');
         }
     }
 }

43) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Business/Model/UserRegistrationValidation.php:37    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     private function validatePassword($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
+        if ((empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password)) && !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
             $errorDTOList[] = new ResponseDTO('Oops, your password doesn\'t look right!', 'Exception');
         }
     }
 }

44) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Business/Model/UserRegistrationValidation.php:37    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     private function validatePassword($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
+        if ((empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password)) && !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
             $errorDTOList[] = new ResponseDTO('Oops, your password doesn\'t look right!', 'Exception');
         }
     }
 }

45) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Business/Model/UserRegistrationValidation.php:37    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     private function validatePassword($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
+        if ((empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password)) && !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
             $errorDTOList[] = new ResponseDTO('Oops, your password doesn\'t look right!', 'Exception');
         }
     }
 }

46) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Business/Model/UserRegistrationValidation.php:42    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     }
     private function validatePassword($clientDTO, &$errorDTOList) : void
     {
-        if (empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) <= 6) {
+        if (empty($clientDTO->password) || !preg_match('@[A-Z]@', $clientDTO->password) || !preg_match('@[a-z]@', $clientDTO->password) || !preg_match('@\\d@', $clientDTO->password) || !preg_match('@\\W@', $clientDTO->password) || strlen($clientDTO->password) < 6) {
             $errorDTOList[] = new ResponseDTO('Oops, your password doesn\'t look right!', 'Exception');
         }
     }
 }

47) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Communication/Mapper/Request2UserDTO.php:14    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     public function request2DTO(Request $request) : UserDTO
     {
-        return new UserDTO(id: $request->get('', 0), email: $request->get('email', ''), username: $request->get('username', ''), password: $request->get('password', ''));
+        return new UserDTO(id: $request->get('', -1), email: $request->get('email', ''), username: $request->get('username', ''), password: $request->get('password', ''));
     }
 }

48) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Communication/Mapper/Request2UserDTO.php:14    [M] IncrementInteger

--- Original
+++ New
@@ @@
 {
     public function request2DTO(Request $request) : UserDTO
     {
-        return new UserDTO(id: $request->get('', 0), email: $request->get('email', ''), username: $request->get('username', ''), password: $request->get('password', ''));
+        return new UserDTO(id: $request->get('', 1), email: $request->get('email', ''), username: $request->get('username', ''), password: $request->get('password', ''));
     }
 }

49) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Registration/Persistence/UserEntityManager.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function register(UserDTO $userDTO) : void
     {
         $user = $this->mapper->getUserEntity($userDTO);
-        $user->setPassword($this->hashPassword($user));
+        
         $this->entityManager->persist($user);
         $this->entityManager->flush();
     }
