50) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Business/Model/ShoppingCartCalculator.php:13    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private const SHIPPING_COST = 4.95;
     public function calculateExpenses(array $shoppingCartItemDtoList) : ShoppingCartExpensesDto
     {
-        $tax = 0;
+        $tax = -1;
         $subTotal = 0;
         foreach ($shoppingCartItemDtoList as $shoppingCartItemDto) {
             $subTotal += $shoppingCartItemDto->price * $shoppingCartItemDto->quantity;

51) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Business/Model/ShoppingCartRead.php:35    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $shoppingCartItemDtoList = [];
         foreach ($shoppingCartSaveDTOArray as $shoppingCartSaveDTO) {
             $item = $this->itemRepository->findOneByItemId($shoppingCartSaveDTO->itemId);
-            if ($item instanceof Items) {
+            if (true) {
                 $shoppingCartItemDTOs = new ShoppingCartItemDto(id: $shoppingCartSaveDTO->id, userId: $shoppingCartSaveDTO->userId, quantity: $shoppingCartSaveDTO->quantity, name: $item->getName(), price: $item->getPrice(), thumbnail: $item->getThumbnail(), itemId: $item->getItemId());
                 $shoppingCartItemDtoList[] = $shoppingCartItemDTOs;
             }

52) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Communication/ShoppingCartController.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         foreach ($shoppingCartItemDtoList as $shoppingCartItemDto) {
             $items[] = $shoppingCartItemDto;
         }
-        return $this->render('shopping_cart/index.html.twig', ['controller_name' => 'ShoppingCartController', 'items' => $items, 'total' => $expenses]);
+        return $this->render('shopping_cart/index.html.twig', ['items' => $items, 'total' => $expenses]);
     }
     #[Route('/shopping/cart/add/{itemId}/{quantity?}', name: 'app_shopping_cart_save', requirements: ['quantity' => '\\d+'], defaults: ['quantity' => 1])]
     public function save(int $itemId, int $quantity) : Response

53) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Persistence/ShoppingCartEntityManager.php:38    [M] Foreach_

--- Original
+++ New
@@ @@
     public function removeAllAfterSuccessfulOrder($userId) : void
     {
         $shoppingCarts = $this->shoppingCartRepository->findShoppingCartEntitiesByUserId($userId);
-        foreach ($shoppingCarts as $shoppingCart) {
+        foreach (array() as $shoppingCart) {
             $this->entityManager->remove($shoppingCart);
         }
         $this->entityManager->flush();

54) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Persistence/ShoppingCartEntityManager.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $shoppingCarts = $this->shoppingCartRepository->findShoppingCartEntitiesByUserId($userId);
         foreach ($shoppingCarts as $shoppingCart) {
-            $this->entityManager->remove($shoppingCart);
+            
         }
         $this->entityManager->flush();
     }

55) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Persistence/ShoppingCartEntityManager.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($shoppingCarts as $shoppingCart) {
             $this->entityManager->remove($shoppingCart);
         }
-        $this->entityManager->flush();
+        
     }
     private function insert(ShoppingCart $cart) : void
     {

56) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Persistence/ShoppingCartRepository.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function findShoppingCartEntitiesByUserId(int $userId) : array
     {
-        return $this->findBy(['user_id' => $userId]);
+        return $this->findBy([]);
     }
     public function findOneByUserIdAndItemId(int $userId, int $itemId) : ?ShoppingCartSaveDTO
     {

57) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Persistence/ShoppingCartRepository.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function findOneByUserIdAndItemId(int $userId, int $itemId) : ?ShoppingCartSaveDTO
     {
-        $shoppingCart = $this->findOneBy(['user_id' => $userId, 'item_id' => $itemId]);
+        $shoppingCart = $this->findOneBy(['item_id' => $itemId]);
         if ($shoppingCart instanceof ShoppingCart) {
             return $this->shoppingCartMapper->mapEntityToDto($shoppingCart);
         }

58) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/ShoppingCart/Persistence/ShoppingCartRepository.php:54    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $shoppingCartSaveDtoList = [];
         $shoppingCart = $this->findBy(['user_id' => $userId]);
         foreach ($shoppingCart as $item) {
-            if ($item instanceof ShoppingCart) {
+            if (true) {
                 $shoppingCartSaveDtoList[] = $this->shoppingCartMapper->mapEntityToDto($item);
             }
         }

59) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:86    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item7->setPosition('Defence');
         $item7->setThumbnail('https://images.pexels.com/photos/15033219/pexels-photo-15033219.jpeg');
         $item7->setTeamId('4');
-        $item7->setItemId(350);
+        $item7->setItemId(349);
         $manager->persist($item7);
         $item8 = new Items();
         $item8->setClubWebsite('http://www.bvb.de');

60) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:86    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item7->setPosition('Defence');
         $item7->setThumbnail('https://images.pexels.com/photos/15033219/pexels-photo-15033219.jpeg');
         $item7->setTeamId('4');
-        $item7->setItemId(350);
+        $item7->setItemId(351);
         $manager->persist($item7);
         $item8 = new Items();
         $item8->setClubWebsite('http://www.bvb.de');

61) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:101    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item8->setPosition('Defence');
         $item8->setThumbnail('https://images.pexels.com/photos/8007498/pexels-photo-8007498.jpeg');
         $item8->setTeamId('4');
-        $item8->setItemId(351);
+        $item8->setItemId(350);
         $manager->persist($item8);
         $item9 = new Items();
         $item9->setClubWebsite('http://www.bvb.de');

62) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:101    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item8->setPosition('Defence');
         $item8->setThumbnail('https://images.pexels.com/photos/8007498/pexels-photo-8007498.jpeg');
         $item8->setTeamId('4');
-        $item8->setItemId(351);
+        $item8->setItemId(352);
         $manager->persist($item8);
         $item9 = new Items();
         $item9->setClubWebsite('http://www.bvb.de');

63) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:102    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item8->setThumbnail('https://images.pexels.com/photos/8007498/pexels-photo-8007498.jpeg');
         $item8->setTeamId('4');
         $item8->setItemId(351);
-        $manager->persist($item8);
+        
         $item9 = new Items();
         $item9->setClubWebsite('http://www.bvb.de');
         $item9->setClubName('Borussia Dortmund');

64) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:116    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item9->setPosition('Defence');
         $item9->setThumbnail('https://images.pexels.com/photos/18256104/pexels-photo-18256104.jpeg');
         $item9->setTeamId('4');
-        $item9->setItemId(3650);
+        $item9->setItemId(3649);
         $manager->persist($item9);
         $item10 = new Items();
         $item10->setClubWebsite('http://www.bvb.de');

65) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:116    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item9->setPosition('Defence');
         $item9->setThumbnail('https://images.pexels.com/photos/18256104/pexels-photo-18256104.jpeg');
         $item9->setTeamId('4');
-        $item9->setItemId(3650);
+        $item9->setItemId(3651);
         $manager->persist($item9);
         $item10 = new Items();
         $item10->setClubWebsite('http://www.bvb.de');

66) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:117    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item9->setThumbnail('https://images.pexels.com/photos/18256104/pexels-photo-18256104.jpeg');
         $item9->setTeamId('4');
         $item9->setItemId(3650);
-        $manager->persist($item9);
+        
         $item10 = new Items();
         $item10->setClubWebsite('http://www.bvb.de');
         $item10->setClubName('Borussia Dortmund');

67) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:131    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item10->setPosition('Defence');
         $item10->setThumbnail('https://images.pexels.com/photos/7084055/pexels-photo-7084055.jpeg');
         $item10->setTeamId('4');
-        $item10->setItemId(6714);
+        $item10->setItemId(6713);
         $manager->persist($item10);
         $item11 = new Items();
         $item11->setClubWebsite('http://www.bvb.de');

68) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:131    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item10->setPosition('Defence');
         $item10->setThumbnail('https://images.pexels.com/photos/7084055/pexels-photo-7084055.jpeg');
         $item10->setTeamId('4');
-        $item10->setItemId(6714);
+        $item10->setItemId(6715);
         $manager->persist($item10);
         $item11 = new Items();
         $item11->setClubWebsite('http://www.bvb.de');

69) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:132    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item10->setThumbnail('https://images.pexels.com/photos/7084055/pexels-photo-7084055.jpeg');
         $item10->setTeamId('4');
         $item10->setItemId(6714);
-        $manager->persist($item10);
+        
         $item11 = new Items();
         $item11->setClubWebsite('http://www.bvb.de');
         $item11->setClubName('Borussia Dortmund');

70) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:161    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item12->setPosition('Defence');
         $item12->setThumbnail('https://images.pexels.com/photos/8007498/pexels-photo-8007498.jpeg');
         $item12->setTeamId('4');
-        $item12->setItemId(44030);
+        $item12->setItemId(44029);
         $manager->persist($item12);
         $item13 = new Items();
         $item13->setClubWebsite('http://www.bvb.de');

71) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:161    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item12->setPosition('Defence');
         $item12->setThumbnail('https://images.pexels.com/photos/8007498/pexels-photo-8007498.jpeg');
         $item12->setTeamId('4');
-        $item12->setItemId(44030);
+        $item12->setItemId(44031);
         $manager->persist($item12);
         $item13 = new Items();
         $item13->setClubWebsite('http://www.bvb.de');

72) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:162    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item12->setThumbnail('https://images.pexels.com/photos/8007498/pexels-photo-8007498.jpeg');
         $item12->setTeamId('4');
         $item12->setItemId(44030);
-        $manager->persist($item12);
+        
         $item13 = new Items();
         $item13->setClubWebsite('http://www.bvb.de');
         $item13->setClubName('Borussia Dortmund');

73) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:176    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item13->setPosition('Defence');
         $item13->setThumbnail('https://images.pexels.com/photos/17485149/pexels-photo-17485149.jpeg');
         $item13->setTeamId('4');
-        $item13->setItemId(58521);
+        $item13->setItemId(58520);
         $manager->persist($item13);
         $item14 = new Items();
         $item14->setClubWebsite('http://www.bvb.de');

74) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:176    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item13->setPosition('Defence');
         $item13->setThumbnail('https://images.pexels.com/photos/17485149/pexels-photo-17485149.jpeg');
         $item13->setTeamId('4');
-        $item13->setItemId(58521);
+        $item13->setItemId(58522);
         $manager->persist($item13);
         $item14 = new Items();
         $item14->setClubWebsite('http://www.bvb.de');

75) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:177    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item13->setThumbnail('https://images.pexels.com/photos/17485149/pexels-photo-17485149.jpeg');
         $item13->setTeamId('4');
         $item13->setItemId(58521);
-        $manager->persist($item13);
+        
         $item14 = new Items();
         $item14->setClubWebsite('http://www.bvb.de');
         $item14->setClubName('Borussia Dortmund');

76) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:191    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item14->setPosition('Defence');
         $item14->setThumbnail('https://images.pexels.com/photos/7556621/pexels-photo-7556621.jpeg');
         $item14->setTeamId('4');
-        $item14->setItemId(75539);
+        $item14->setItemId(75538);
         $manager->persist($item14);
         $item15 = new Items();
         $item15->setClubWebsite('http://www.bvb.de');

77) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:191    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item14->setPosition('Defence');
         $item14->setThumbnail('https://images.pexels.com/photos/7556621/pexels-photo-7556621.jpeg');
         $item14->setTeamId('4');
-        $item14->setItemId(75539);
+        $item14->setItemId(75540);
         $manager->persist($item14);
         $item15 = new Items();
         $item15->setClubWebsite('http://www.bvb.de');

78) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:192    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item14->setThumbnail('https://images.pexels.com/photos/7556621/pexels-photo-7556621.jpeg');
         $item14->setTeamId('4');
         $item14->setItemId(75539);
-        $manager->persist($item14);
+        
         $item15 = new Items();
         $item15->setClubWebsite('http://www.bvb.de');
         $item15->setClubName('Borussia Dortmund');

79) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:206    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item15->setPosition('Defence');
         $item15->setThumbnail('https://images.pexels.com/photos/15033210/pexels-photo-15033210.jpeg');
         $item15->setTeamId('4');
-        $item15->setItemId(120984);
+        $item15->setItemId(120983);
         $manager->persist($item15);
         $item16 = new Items();
         $item16->setClubWebsite('http://www.bvb.de');

80) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:206    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item15->setPosition('Defence');
         $item15->setThumbnail('https://images.pexels.com/photos/15033210/pexels-photo-15033210.jpeg');
         $item15->setTeamId('4');
-        $item15->setItemId(120984);
+        $item15->setItemId(120985);
         $manager->persist($item15);
         $item16 = new Items();
         $item16->setClubWebsite('http://www.bvb.de');

81) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:207    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item15->setThumbnail('https://images.pexels.com/photos/15033210/pexels-photo-15033210.jpeg');
         $item15->setTeamId('4');
         $item15->setItemId(120984);
-        $manager->persist($item15);
+        
         $item16 = new Items();
         $item16->setClubWebsite('http://www.bvb.de');
         $item16->setClubName('Borussia Dortmund');

82) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:221    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item16->setPosition('Defence');
         $item16->setThumbnail('https://images.pexels.com/photos/3653331/pexels-photo-3653331.jpeg');
         $item16->setTeamId('4');
-        $item16->setItemId(131120);
+        $item16->setItemId(131119);
         $manager->persist($item16);
         $item17 = new Items();
         $item17->setClubWebsite('http://www.bvb.de');

83) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:221    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item16->setPosition('Defence');
         $item16->setThumbnail('https://images.pexels.com/photos/3653331/pexels-photo-3653331.jpeg');
         $item16->setTeamId('4');
-        $item16->setItemId(131120);
+        $item16->setItemId(131121);
         $manager->persist($item16);
         $item17 = new Items();
         $item17->setClubWebsite('http://www.bvb.de');

84) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:222    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item16->setThumbnail('https://images.pexels.com/photos/3653331/pexels-photo-3653331.jpeg');
         $item16->setTeamId('4');
         $item16->setItemId(131120);
-        $manager->persist($item16);
+        
         $item17 = new Items();
         $item17->setClubWebsite('http://www.bvb.de');
         $item17->setClubName('Borussia Dortmund');

85) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:236    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item17->setPosition('Defence');
         $item17->setThumbnail('https://images.pexels.com/photos/8111439/pexels-photo-8111439.jpeg');
         $item17->setTeamId('4');
-        $item17->setItemId(177664);
+        $item17->setItemId(177663);
         $manager->persist($item17);
         $item18 = new Items();
         $item18->setClubWebsite('http://www.bvb.de');

86) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:236    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item17->setPosition('Defence');
         $item17->setThumbnail('https://images.pexels.com/photos/8111439/pexels-photo-8111439.jpeg');
         $item17->setTeamId('4');
-        $item17->setItemId(177664);
+        $item17->setItemId(177665);
         $manager->persist($item17);
         $item18 = new Items();
         $item18->setClubWebsite('http://www.bvb.de');

87) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:237    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item17->setThumbnail('https://images.pexels.com/photos/8111439/pexels-photo-8111439.jpeg');
         $item17->setTeamId('4');
         $item17->setItemId(177664);
-        $manager->persist($item17);
+        
         $item18 = new Items();
         $item18->setClubWebsite('http://www.bvb.de');
         $item18->setClubName('Borussia Dortmund');

88) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:251    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item18->setPosition('Defence');
         $item18->setThumbnail('https://images.pexels.com/photos/18798576/pexels-photo-18798576.jpeg');
         $item18->setTeamId('4');
-        $item18->setItemId(212298);
+        $item18->setItemId(212297);
         $manager->persist($item18);
         $item19 = new Items();
         $item19->setClubWebsite('http://www.bvb.de');

89) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:251    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item18->setPosition('Defence');
         $item18->setThumbnail('https://images.pexels.com/photos/18798576/pexels-photo-18798576.jpeg');
         $item18->setTeamId('4');
-        $item18->setItemId(212298);
+        $item18->setItemId(212299);
         $manager->persist($item18);
         $item19 = new Items();
         $item19->setClubWebsite('http://www.bvb.de');

90) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:252    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item18->setThumbnail('https://images.pexels.com/photos/18798576/pexels-photo-18798576.jpeg');
         $item18->setTeamId('4');
         $item18->setItemId(212298);
-        $manager->persist($item18);
+        
         $item19 = new Items();
         $item19->setClubWebsite('http://www.bvb.de');
         $item19->setClubName('Borussia Dortmund');

91) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:266    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item19->setPosition('Midfield');
         $item19->setThumbnail('https://images.pexels.com/photos/8120617/pexels-photo-8120617.jpeg');
         $item19->setTeamId('4');
-        $item19->setItemId(138);
+        $item19->setItemId(137);
         $manager->persist($item19);
         $item20 = new Items();
         $item20->setClubWebsite('http://www.bvb.de');

92) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:266    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item19->setPosition('Midfield');
         $item19->setThumbnail('https://images.pexels.com/photos/8120617/pexels-photo-8120617.jpeg');
         $item19->setTeamId('4');
-        $item19->setItemId(138);
+        $item19->setItemId(139);
         $manager->persist($item19);
         $item20 = new Items();
         $item20->setClubWebsite('http://www.bvb.de');

93) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:267    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item19->setThumbnail('https://images.pexels.com/photos/8120617/pexels-photo-8120617.jpeg');
         $item19->setTeamId('4');
         $item19->setItemId(138);
-        $manager->persist($item19);
+        
         $item20 = new Items();
         $item20->setClubWebsite('http://www.bvb.de');
         $item20->setClubName('Borussia Dortmund');

94) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:281    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item20->setPosition('Midfield');
         $item20->setThumbnail('https://images.pexels.com/photos/5246966/pexels-photo-5246966.jpeg');
         $item20->setTeamId('4');
-        $item20->setItemId(146);
+        $item20->setItemId(145);
         $manager->persist($item20);
         $item21 = new Items();
         $item21->setClubWebsite('http://www.bvb.de');

95) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:281    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item20->setPosition('Midfield');
         $item20->setThumbnail('https://images.pexels.com/photos/5246966/pexels-photo-5246966.jpeg');
         $item20->setTeamId('4');
-        $item20->setItemId(146);
+        $item20->setItemId(147);
         $manager->persist($item20);
         $item21 = new Items();
         $item21->setClubWebsite('http://www.bvb.de');

96) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:282    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item20->setThumbnail('https://images.pexels.com/photos/5246966/pexels-photo-5246966.jpeg');
         $item20->setTeamId('4');
         $item20->setItemId(146);
-        $manager->persist($item20);
+        
         $item21 = new Items();
         $item21->setClubWebsite('http://www.bvb.de');
         $item21->setClubName('Borussia Dortmund');

97) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:296    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item21->setPosition('Midfield');
         $item21->setThumbnail('https://images.pexels.com/photos/19079608/pexels-photo-19079608.jpeg');
         $item21->setTeamId('4');
-        $item21->setItemId(201);
+        $item21->setItemId(200);
         $manager->persist($item21);
         $item22 = new Items();
         $item22->setClubWebsite('http://www.bvb.de');

98) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:296    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item21->setPosition('Midfield');
         $item21->setThumbnail('https://images.pexels.com/photos/19079608/pexels-photo-19079608.jpeg');
         $item21->setTeamId('4');
-        $item21->setItemId(201);
+        $item21->setItemId(202);
         $manager->persist($item21);
         $item22 = new Items();
         $item22->setClubWebsite('http://www.bvb.de');

99) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:297    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item21->setThumbnail('https://images.pexels.com/photos/19079608/pexels-photo-19079608.jpeg');
         $item21->setTeamId('4');
         $item21->setItemId(201);
-        $manager->persist($item21);
+        
         $item22 = new Items();
         $item22->setClubWebsite('http://www.bvb.de');
         $item22->setClubName('Borussia Dortmund');

100) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:311    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item22->setPosition('Midfield');
         $item22->setThumbnail('https://images.pexels.com/photos/7399346/pexels-photo-7399346.jpeg');
         $item22->setTeamId('4');
-        $item22->setItemId(3183);
+        $item22->setItemId(3182);
         $manager->persist($item22);
         $item23 = new Items();
         $item23->setClubWebsite('http://www.bvb.de');

101) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:311    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item22->setPosition('Midfield');
         $item22->setThumbnail('https://images.pexels.com/photos/7399346/pexels-photo-7399346.jpeg');
         $item22->setTeamId('4');
-        $item22->setItemId(3183);
+        $item22->setItemId(3184);
         $manager->persist($item22);
         $item23 = new Items();
         $item23->setClubWebsite('http://www.bvb.de');

102) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:312    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item22->setThumbnail('https://images.pexels.com/photos/7399346/pexels-photo-7399346.jpeg');
         $item22->setTeamId('4');
         $item22->setItemId(3183);
-        $manager->persist($item22);
+        
         $item23 = new Items();
         $item23->setClubWebsite('http://www.bvb.de');
         $item23->setClubName('Borussia Dortmund');

103) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:326    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item23->setPosition('Midfield');
         $item23->setThumbnail('https://images.pexels.com/photos/19079606/pexels-photo-19079606.jpeg');
         $item23->setTeamId('4');
-        $item23->setItemId(101074);
+        $item23->setItemId(101073);
         $manager->persist($item23);
         $item24 = new Items();
         $item24->setClubWebsite('http://www.bvb.de');

104) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:326    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item23->setPosition('Midfield');
         $item23->setThumbnail('https://images.pexels.com/photos/19079606/pexels-photo-19079606.jpeg');
         $item23->setTeamId('4');
-        $item23->setItemId(101074);
+        $item23->setItemId(101075);
         $manager->persist($item23);
         $item24 = new Items();
         $item24->setClubWebsite('http://www.bvb.de');

105) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:327    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item23->setThumbnail('https://images.pexels.com/photos/19079606/pexels-photo-19079606.jpeg');
         $item23->setTeamId('4');
         $item23->setItemId(101074);
-        $manager->persist($item23);
+        
         $item24 = new Items();
         $item24->setClubWebsite('http://www.bvb.de');
         $item24->setClubName('Borussia Dortmund');

106) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:341    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item24->setPosition('Midfield');
         $item24->setThumbnail('https://images.pexels.com/photos/15033215/pexels-photo-15033215.jpeg');
         $item24->setTeamId('4');
-        $item24->setItemId(161415);
+        $item24->setItemId(161414);
         $manager->persist($item24);
         $item25 = new Items();
         $item25->setClubWebsite('http://www.bvb.de');
