107) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:341    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item24->setPosition('Midfield');
         $item24->setThumbnail('https://images.pexels.com/photos/15033215/pexels-photo-15033215.jpeg');
         $item24->setTeamId('4');
-        $item24->setItemId(161415);
+        $item24->setItemId(161416);
         $manager->persist($item24);
         $item25 = new Items();
         $item25->setClubWebsite('http://www.bvb.de');

108) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:342    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item24->setThumbnail('https://images.pexels.com/photos/15033215/pexels-photo-15033215.jpeg');
         $item24->setTeamId('4');
         $item24->setItemId(161415);
-        $manager->persist($item24);
+        
         $item25 = new Items();
         $item25->setClubWebsite('http://www.bvb.de');
         $item25->setClubName('Borussia Dortmund');

109) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:356    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item25->setPosition('Midfield');
         $item25->setThumbnail('https://images.pexels.com/photos/3653376/pexels-photo-3653376.jpeg');
         $item25->setTeamId('4');
-        $item25->setItemId(179460);
+        $item25->setItemId(179459);
         $manager->persist($item25);
         $item26 = new Items();
         $item26->setClubWebsite('http://www.bvb.de');

110) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:356    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item25->setPosition('Midfield');
         $item25->setThumbnail('https://images.pexels.com/photos/3653376/pexels-photo-3653376.jpeg');
         $item25->setTeamId('4');
-        $item25->setItemId(179460);
+        $item25->setItemId(179461);
         $manager->persist($item25);
         $item26 = new Items();
         $item26->setClubWebsite('http://www.bvb.de');

111) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:357    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item25->setThumbnail('https://images.pexels.com/photos/3653376/pexels-photo-3653376.jpeg');
         $item25->setTeamId('4');
         $item25->setItemId(179460);
-        $manager->persist($item25);
+        
         $item26 = new Items();
         $item26->setClubWebsite('http://www.bvb.de');
         $item26->setClubName('Borussia Dortmund');

112) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:371    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item26->setPosition('Offence');
         $item26->setThumbnail('https://images.pexels.com/photos/19079601/pexels-photo-19079601.jpeg');
         $item26->setTeamId('4');
-        $item26->setItemId(148);
+        $item26->setItemId(147);
         $manager->persist($item26);
         $item27 = new Items();
         $item27->setClubWebsite('http://www.bvb.de');

113) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:371    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item26->setPosition('Offence');
         $item26->setThumbnail('https://images.pexels.com/photos/19079601/pexels-photo-19079601.jpeg');
         $item26->setTeamId('4');
-        $item26->setItemId(148);
+        $item26->setItemId(149);
         $manager->persist($item26);
         $item27 = new Items();
         $item27->setClubWebsite('http://www.bvb.de');

114) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:372    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item26->setThumbnail('https://images.pexels.com/photos/19079601/pexels-photo-19079601.jpeg');
         $item26->setTeamId('4');
         $item26->setItemId(148);
-        $manager->persist($item26);
+        
         $item27 = new Items();
         $item27->setClubWebsite('http://www.bvb.de');
         $item27->setClubName('Borussia Dortmund');

115) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:386    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item27->setPosition('Offence');
         $item27->setThumbnail('https://images.pexels.com/photos/7928625/pexels-photo-7928625.jpeg');
         $item27->setTeamId('4');
-        $item27->setItemId(304);
+        $item27->setItemId(303);
         $manager->persist($item27);
         $item28 = new Items();
         $item28->setClubWebsite('http://www.bvb.de');

116) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:386    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item27->setPosition('Offence');
         $item27->setThumbnail('https://images.pexels.com/photos/7928625/pexels-photo-7928625.jpeg');
         $item27->setTeamId('4');
-        $item27->setItemId(304);
+        $item27->setItemId(305);
         $manager->persist($item27);
         $item28 = new Items();
         $item28->setClubWebsite('http://www.bvb.de');

117) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:387    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item27->setThumbnail('https://images.pexels.com/photos/7928625/pexels-photo-7928625.jpeg');
         $item27->setTeamId('4');
         $item27->setItemId(304);
-        $manager->persist($item27);
+        
         $item28 = new Items();
         $item28->setClubWebsite('http://www.bvb.de');
         $item28->setClubName('Borussia Dortmund');

118) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:401    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item28->setPosition('Offence');
         $item28->setThumbnail('https://images.pexels.com/photos/19079607/pexels-photo-19079607.jpeg');
         $item28->setTeamId('4');
-        $item28->setItemId(6721);
+        $item28->setItemId(6720);
         $manager->persist($item28);
         $item29 = new Items();
         $item29->setClubWebsite('http://www.bvb.de');

119) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:401    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item28->setPosition('Offence');
         $item28->setThumbnail('https://images.pexels.com/photos/19079607/pexels-photo-19079607.jpeg');
         $item28->setTeamId('4');
-        $item28->setItemId(6721);
+        $item28->setItemId(6722);
         $manager->persist($item28);
         $item29 = new Items();
         $item29->setClubWebsite('http://www.bvb.de');

120) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:402    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item28->setThumbnail('https://images.pexels.com/photos/19079607/pexels-photo-19079607.jpeg');
         $item28->setTeamId('4');
         $item28->setItemId(6721);
-        $manager->persist($item28);
+        
         $item29 = new Items();
         $item29->setClubWebsite('http://www.bvb.de');
         $item29->setClubName('Borussia Dortmund');

121) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:416    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item29->setPosition('Offence');
         $item29->setThumbnail('https://images.pexels.com/photos/19917366/pexels-photo-19917366.jpeg');
         $item29->setTeamId('4');
-        $item29->setItemId(7457);
+        $item29->setItemId(7456);
         $manager->persist($item29);
         $item30 = new Items();
         $item30->setClubWebsite('http://www.bvb.de');

122) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:416    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item29->setPosition('Offence');
         $item29->setThumbnail('https://images.pexels.com/photos/19917366/pexels-photo-19917366.jpeg');
         $item29->setTeamId('4');
-        $item29->setItemId(7457);
+        $item29->setItemId(7458);
         $manager->persist($item29);
         $item30 = new Items();
         $item30->setClubWebsite('http://www.bvb.de');

123) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:417    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item29->setThumbnail('https://images.pexels.com/photos/19917366/pexels-photo-19917366.jpeg');
         $item29->setTeamId('4');
         $item29->setItemId(7457);
-        $manager->persist($item29);
+        
         $item30 = new Items();
         $item30->setClubWebsite('http://www.bvb.de');
         $item30->setClubName('Borussia Dortmund');

124) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:431    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item30->setPosition('Offence');
         $item30->setThumbnail('https://images.pexels.com/photos/1884580/pexels-photo-1884580.jpeg');
         $item30->setTeamId('4');
-        $item30->setItemId(9551);
+        $item30->setItemId(9550);
         $manager->persist($item30);
         $item31 = new Items();
         $item31->setClubWebsite('http://www.bvb.de');

125) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:431    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item30->setPosition('Offence');
         $item30->setThumbnail('https://images.pexels.com/photos/1884580/pexels-photo-1884580.jpeg');
         $item30->setTeamId('4');
-        $item30->setItemId(9551);
+        $item30->setItemId(9552);
         $manager->persist($item30);
         $item31 = new Items();
         $item31->setClubWebsite('http://www.bvb.de');

126) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:432    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item30->setThumbnail('https://images.pexels.com/photos/1884580/pexels-photo-1884580.jpeg');
         $item30->setTeamId('4');
         $item30->setItemId(9551);
-        $manager->persist($item30);
+        
         $item31 = new Items();
         $item31->setClubWebsite('http://www.bvb.de');
         $item31->setClubName('Borussia Dortmund');

127) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:446    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item31->setPosition('Offence');
         $item31->setThumbnail('https://images.pexels.com/photos/5247136/pexels-photo-5247136.jpeg');
         $item31->setTeamId('4');
-        $item31->setItemId(82515);
+        $item31->setItemId(82514);
         $manager->persist($item31);
         $item32 = new Items();
         $item32->setClubWebsite('http://www.bvb.de');

128) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:446    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item31->setPosition('Offence');
         $item31->setThumbnail('https://images.pexels.com/photos/5247136/pexels-photo-5247136.jpeg');
         $item31->setTeamId('4');
-        $item31->setItemId(82515);
+        $item31->setItemId(82516);
         $manager->persist($item31);
         $item32 = new Items();
         $item32->setClubWebsite('http://www.bvb.de');

129) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:447    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item31->setThumbnail('https://images.pexels.com/photos/5247136/pexels-photo-5247136.jpeg');
         $item31->setTeamId('4');
         $item31->setItemId(82515);
-        $manager->persist($item31);
+        
         $item32 = new Items();
         $item32->setClubWebsite('http://www.bvb.de');
         $item32->setClubName('Borussia Dortmund');

130) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:461    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item32->setPosition('Offence');
         $item32->setThumbnail('https://images.pexels.com/photos/15023680/pexels-photo-15023680.jpeg');
         $item32->setTeamId('4');
-        $item32->setItemId(136733);
+        $item32->setItemId(136732);
         $manager->persist($item32);
         $item33 = new Items();
         $item33->setClubWebsite('http://www.bvb.de');

131) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:461    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item32->setPosition('Offence');
         $item32->setThumbnail('https://images.pexels.com/photos/15023680/pexels-photo-15023680.jpeg');
         $item32->setTeamId('4');
-        $item32->setItemId(136733);
+        $item32->setItemId(136734);
         $manager->persist($item32);
         $item33 = new Items();
         $item33->setClubWebsite('http://www.bvb.de');

132) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:462    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item32->setThumbnail('https://images.pexels.com/photos/15023680/pexels-photo-15023680.jpeg');
         $item32->setTeamId('4');
         $item32->setItemId(136733);
-        $manager->persist($item32);
+        
         $item33 = new Items();
         $item33->setClubWebsite('http://www.bvb.de');
         $item33->setClubName('Borussia Dortmund');

133) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:476    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item33->setPosition('Offence');
         $item33->setThumbnail('https://images.pexels.com/photos/17395073/pexels-photo-17395073.jpeg');
         $item33->setTeamId('4');
-        $item33->setItemId(142162);
+        $item33->setItemId(142161);
         $manager->persist($item33);
         $item34 = new Items();
         $item34->setClubWebsite('http://www.bvb.de');

134) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:476    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item33->setPosition('Offence');
         $item33->setThumbnail('https://images.pexels.com/photos/17395073/pexels-photo-17395073.jpeg');
         $item33->setTeamId('4');
-        $item33->setItemId(142162);
+        $item33->setItemId(142163);
         $manager->persist($item33);
         $item34 = new Items();
         $item34->setClubWebsite('http://www.bvb.de');

135) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:477    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item33->setThumbnail('https://images.pexels.com/photos/17395073/pexels-photo-17395073.jpeg');
         $item33->setTeamId('4');
         $item33->setItemId(142162);
-        $manager->persist($item33);
+        
         $item34 = new Items();
         $item34->setClubWebsite('http://www.bvb.de');
         $item34->setClubName('Borussia Dortmund');

136) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:491    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item34->setPosition('Offence');
         $item34->setThumbnail('https://images.pexels.com/photos/15033216/pexels-photo-15033216.jpeg');
         $item34->setTeamId('4');
-        $item34->setItemId(150817);
+        $item34->setItemId(150816);
         $manager->persist($item34);
         $item35 = new Items();
         $item35->setClubWebsite('http://www.bvb.de');

137) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:491    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item34->setPosition('Offence');
         $item34->setThumbnail('https://images.pexels.com/photos/15033216/pexels-photo-15033216.jpeg');
         $item34->setTeamId('4');
-        $item34->setItemId(150817);
+        $item34->setItemId(150818);
         $manager->persist($item34);
         $item35 = new Items();
         $item35->setClubWebsite('http://www.bvb.de');

138) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:492    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item34->setThumbnail('https://images.pexels.com/photos/15033216/pexels-photo-15033216.jpeg');
         $item34->setTeamId('4');
         $item34->setItemId(150817);
-        $manager->persist($item34);
+        
         $item35 = new Items();
         $item35->setClubWebsite('http://www.bvb.de');
         $item35->setClubName('Borussia Dortmund');

139) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:506    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item35->setPosition('Offence');
         $item35->setThumbnail('https://images.pexels.com/photos/8217358/pexels-photo-8217358.jpeg');
         $item35->setTeamId('4');
-        $item35->setItemId(192607);
+        $item35->setItemId(192606);
         $manager->persist($item35);
         $item36 = new Items();
         $item36->setClubWebsite('http://www.bvb.de');

140) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:506    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item35->setPosition('Offence');
         $item35->setThumbnail('https://images.pexels.com/photos/8217358/pexels-photo-8217358.jpeg');
         $item35->setTeamId('4');
-        $item35->setItemId(192607);
+        $item35->setItemId(192608);
         $manager->persist($item35);
         $item36 = new Items();
         $item36->setClubWebsite('http://www.bvb.de');

141) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:507    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item35->setThumbnail('https://images.pexels.com/photos/8217358/pexels-photo-8217358.jpeg');
         $item35->setTeamId('4');
         $item35->setItemId(192607);
-        $manager->persist($item35);
+        
         $item36 = new Items();
         $item36->setClubWebsite('http://www.bvb.de');
         $item36->setClubName('Borussia Dortmund');

142) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:521    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item36->setPosition('Offence');
         $item36->setThumbnail('https://images.pexels.com/photos/5247133/pexels-photo-5247133.jpeg');
         $item36->setTeamId('4');
-        $item36->setItemId(244696);
+        $item36->setItemId(244695);
         $manager->persist($item36);
         $item37 = new Items();
         $item37->setClubWebsite('http://www.bvb.de');

143) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:521    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item36->setPosition('Offence');
         $item36->setThumbnail('https://images.pexels.com/photos/5247133/pexels-photo-5247133.jpeg');
         $item36->setTeamId('4');
-        $item36->setItemId(244696);
+        $item36->setItemId(244697);
         $manager->persist($item36);
         $item37 = new Items();
         $item37->setClubWebsite('http://www.bvb.de');

144) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:522    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item36->setThumbnail('https://images.pexels.com/photos/5247133/pexels-photo-5247133.jpeg');
         $item36->setTeamId('4');
         $item36->setItemId(244696);
-        $manager->persist($item36);
+        
         $item37 = new Items();
         $item37->setClubWebsite('http://www.bvb.de');
         $item37->setClubName('Borussia Dortmund');

145) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:536    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $item37->setPosition('Forward');
         $item37->setThumbnail('https://images.pexels.com/photos/8111295/pexels-photo-8111295.jpeg');
         $item37->setTeamId('4');
-        $item37->setItemId(182280);
+        $item37->setItemId(182279);
         $manager->persist($item37);
         $manager->flush();
     }
 }

146) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:536    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $item37->setPosition('Forward');
         $item37->setThumbnail('https://images.pexels.com/photos/8111295/pexels-photo-8111295.jpeg');
         $item37->setTeamId('4');
-        $item37->setItemId(182280);
+        $item37->setItemId(182281);
         $manager->persist($item37);
         $manager->flush();
     }
 }

147) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ItemsFixture.php:537    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $item37->setThumbnail('https://images.pexels.com/photos/8111295/pexels-photo-8111295.jpeg');
         $item37->setTeamId('4');
         $item37->setItemId(182280);
-        $manager->persist($item37);
+        
         $manager->flush();
     }
 }

148) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/OrdersFixture.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $order1->setDeliveryMethod('Standard');
         $order1->setPaymentMethod('Credit Card');
         $order1->setDue(100.5);
-        $order1->setItems(['item1', 'item2']);
+        $order1->setItems(['item2']);
         $manager->persist($order1);
         $order2 = new Orders();
         $order2->setEmail('Hannah@montana.com');

149) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/OrdersFixture.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $order1->setDeliveryMethod('Standard');
         $order1->setPaymentMethod('Credit Card');
         $order1->setDue(100.5);
-        $order1->setItems(['item1', 'item2']);
+        
         $manager->persist($order1);
         $order2 = new Orders();
         $order2->setEmail('Hannah@montana.com');

150) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/OrdersFixture.php:41    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $order2->setDeliveryMethod('Express');
         $order2->setPaymentMethod('PayPal');
         $order2->setDue(250.75);
-        $order2->setItems(['item3', 'item4']);
+        $order2->setItems(['item4']);
         $manager->persist($order2);
         $manager->flush();
     }
 }

151) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/OrdersFixture.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $order2->setDeliveryMethod('Express');
         $order2->setPaymentMethod('PayPal');
         $order2->setDue(250.75);
-        $order2->setItems(['item3', 'item4']);
+        
         $manager->persist($order2);
         $manager->flush();
     }
 }

152) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/OrdersFixture.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $order2->setPaymentMethod('PayPal');
         $order2->setDue(250.75);
         $order2->setItems(['item3', 'item4']);
-        $manager->persist($order2);
+        
         $manager->flush();
     }
 }

153) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $shoppingCart1 = new ShoppingCart();
         $shoppingCart1->setUserId(1);
-        $shoppingCart1->setThumbnail('thumbnail1.com');
+        
         $shoppingCart1->setName('firstItem');
         $shoppingCart1->setPrice(99.33);
         $shoppingCart1->setItemId(334);

154) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart1 = new ShoppingCart();
         $shoppingCart1->setUserId(1);
         $shoppingCart1->setThumbnail('thumbnail1.com');
-        $shoppingCart1->setName('firstItem');
+        
         $shoppingCart1->setPrice(99.33);
         $shoppingCart1->setItemId(334);
         $shoppingCart1->setQuantity(3);

155) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart1->setUserId(1);
         $shoppingCart1->setThumbnail('thumbnail1.com');
         $shoppingCart1->setName('firstItem');
-        $shoppingCart1->setPrice(99.33);
+        
         $shoppingCart1->setItemId(334);
         $shoppingCart1->setQuantity(3);
         $shoppingCart2 = new ShoppingCart();

156) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart1->setQuantity(3);
         $shoppingCart2 = new ShoppingCart();
         $shoppingCart2->setUserId(1);
-        $shoppingCart2->setThumbnail('thumbnail2.com');
+        
         $shoppingCart2->setName('secondItem');
         $shoppingCart2->setPrice(33.33);
         $shoppingCart2->setItemId(176268);

157) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart2 = new ShoppingCart();
         $shoppingCart2->setUserId(1);
         $shoppingCart2->setThumbnail('thumbnail2.com');
-        $shoppingCart2->setName('secondItem');
+        
         $shoppingCart2->setPrice(33.33);
         $shoppingCart2->setItemId(176268);
         $shoppingCart2->setQuantity(5);

158) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart2->setUserId(1);
         $shoppingCart2->setThumbnail('thumbnail2.com');
         $shoppingCart2->setName('secondItem');
-        $shoppingCart2->setPrice(33.33);
+        
         $shoppingCart2->setItemId(176268);
         $shoppingCart2->setQuantity(5);
         $shoppingCart3 = new ShoppingCart();

159) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart2->setQuantity(5);
         $shoppingCart3 = new ShoppingCart();
         $shoppingCart3->setUserId(1);
-        $shoppingCart3->setThumbnail('thumbnail3.com');
+        
         $shoppingCart3->setName('THIRDiTEM');
         $shoppingCart3->setPrice(24.99);
         $shoppingCart3->setItemId(151077);

160) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart3 = new ShoppingCart();
         $shoppingCart3->setUserId(1);
         $shoppingCart3->setThumbnail('thumbnail3.com');
-        $shoppingCart3->setName('THIRDiTEM');
+        
         $shoppingCart3->setPrice(24.99);
         $shoppingCart3->setItemId(151077);
         $shoppingCart3->setQuantity(5);

161) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/ShoppingCartFixture.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $shoppingCart3->setUserId(1);
         $shoppingCart3->setThumbnail('thumbnail3.com');
         $shoppingCart3->setName('THIRDiTEM');
-        $shoppingCart3->setPrice(24.99);
+        
         $shoppingCart3->setItemId(151077);
         $shoppingCart3->setQuantity(5);
         $manager->persist($shoppingCart1);

162) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/UserFixture.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->setEmail('John@doe.com');
         $user->setUsername('John Doe');
         $user->setPassword('Qwertz123');
-        $user->setRoles([]);
+        
         $manager->persist($user);
         $user = new User();
         $user->setEmail('Hannah@montana.com');

163) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/UserFixture.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $manager->persist($user);
         $user = new User();
         $user->setEmail('Hannah@montana.com');
-        $user->setUsername('Hannah Montana');
+        
         $user->setPassword(password_hash('Qwertz123**', PASSWORD_DEFAULT));
         $user->setRoles([]);
         $manager->persist($user);

164) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/DataFixtures/UserFixture.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->setEmail('Hannah@montana.com');
         $user->setUsername('Hannah Montana');
         $user->setPassword(password_hash('Qwertz123**', PASSWORD_DEFAULT));
-        $user->setRoles([]);
+        
         $manager->persist($user);
         $manager->flush();
     }
 }

165) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/DTO/UserDTO.php:8    [M] DecrementInteger

--- Original
+++ New
@@ @@
 
 class UserDTO
 {
-    public function __construct(public readonly int $id = 0, public readonly string $email = '', public readonly string $username = '', public readonly string $password = '')
+    public function __construct(public readonly int $id = -1, public readonly string $email = '', public readonly string $username = '', public readonly string $password = '')
     {
     }
 }

166) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/DTO/UserDTO.php:8    [M] IncrementInteger

--- Original
+++ New
@@ @@
 
 class UserDTO
 {
-    public function __construct(public readonly int $id = 0, public readonly string $email = '', public readonly string $username = '', public readonly string $password = '')
+    public function __construct(public readonly int $id = 1, public readonly string $email = '', public readonly string $username = '', public readonly string $password = '')
     {
     }
 }
