167) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/Mapping/Mapper.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use App\Global\Persistence\DTO\UserDTO;
 class Mapper
 {
-    public function mapRandomImage(array $imageArray) : string
+    protected function mapRandomImage(array $imageArray) : string
     {
         $entry = array_rand($imageArray['photos']);
         return $imageArray['photos'][$entry]['src']['original'];

168) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/Mapping/Mapper.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function mapItems(array $images, array $footballArray) : array
     {
         $itemDTOArray = [];
-        $prices = [29.95, 22.95, 39.95, 25.95, 20.95, 32.95, 35.95, 19.99, 27.95, 21.99];
+        $prices = [22.95, 39.95, 25.95, 20.95, 32.95, 35.95, 19.99, 27.95, 21.99];
         // Array of prices
         foreach ($footballArray['squad'] as $footballItem) {
             $itemDTO = new ItemDTO();

169) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/Mapping/Mapper.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = new User();
         $user->setEmail($userDTO->email);
         $user->setPassword($userDTO->password);
-        $user->setUsername($userDTO->username);
+        
         return $user;
     }
 }

170) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/Repository/ItemRepository.php:63    [M] UnwrapArrayColumn

--- Original
+++ New
@@ @@
      */
     public function findItemsByArrayOfIds(array $itemsWithQuantities) : array
     {
-        $itemIds = array_column($itemsWithQuantities, 'id');
+        $itemIds = $itemsWithQuantities;
         $query = $this->createQueryBuilder('i')->where('i.item_id IN (:ids)')->setParameter('ids', $itemIds)->getQuery();
         return $query->getResult();
     }
 }

173) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/Repository/UserRepository.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', $user::class));
         }
         $user->setPassword($newHashedPassword);
-        $this->getEntityManager()->persist($user);
+        
         $this->getEntityManager()->flush();
     }
     public function findOneByEmail($email) : ?User

174) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/Repository/UserRepository.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $user->setPassword($newHashedPassword);
         $this->getEntityManager()->persist($user);
-        $this->getEntityManager()->flush();
+        
     }
     public function findOneByEmail($email) : ?User
     {

175) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Global/Persistence/Repository/UserRepository.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->getEntityManager()->persist($user);
         $this->getEntityManager()->flush();
     }
-    public function findOneByEmail($email) : ?User
+    protected function findOneByEmail($email) : ?User
     {
         return $this->createQueryBuilder('u')->andWhere('u.email = :email')->setParameter('email', $email)->getQuery()->getOneOrNullResult();
     }
 }


Timed Out mutants:
==================
