5) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Business/OrderFlowValidation.php:25    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     private function validateFirstName($firstName) : ?ResponseDTO
     {
-        if (empty($firstName) || !is_string($firstName)) {
+        if (empty($firstName) && !is_string($firstName)) {
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
         $firstName = $this->trim($firstName);

8) /home/nicogruenewald/Documents/BuyMyTrikots-Symfony/src/Components/Orderflow/Business/OrderFlowValidation.php:31    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
             return new ResponseDTO('First name cannot be empty and must be a string.', 'Error');
         }
         $firstName = $this->trim($firstName);
-        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/^[\\p{L}\\s-]+$/u', $firstName)) {
+        if (strlen($firstName) >= 30 || strlen($firstName) <= 2 || !preg_match('/[\\p{L}\\s-]+$/u', $firstName)) {
             return new ResponseDTO('Oops, your first name doesn\'t look right!', 'Error');
         }
         return null;
